
/* Strings for login panel. See Keychain.cpp. */

"kLoginTitle" = "Ange namn och lösenord om du vill ansluta till RSS-strömmen.";
"kLoginInitialMessage"      = "Om du vill ansluta till RSS-strömmen ”%@” måste du logga in på området ”%@” på %@. Ditt lösenord kommer att skickas i klartext.\n";
"kLoginFailedMessage"       = "Inloggningen misslyckades. Skriv in användarnamnet och lösenordet för området ”%@” på %@.\n";
"kLoginUsernameField"       = "Namn:";
"kLoginPasswordField"       = "Lösenord:";
"kLoginLogInButton"         = "Logga in";
"kLoginCancelButton"        = "Avbryt";
"kLoginSavePasswordCheckbox"= "Kom ihåg lösenordet i min nyckelring";


/* Error Messages */

"PSInternalErrorDescription"        = "Ett internt fel inträffade i ramverket för publiceringsprenumeration.";
"PSInternalErrorFailureReason"      = "Ett internt fel inträffade i ramverket för publiceringsprenumeration.";
"PSInternalErrorRecoverySuggestion" = "Logga ut och försök igen.";

"PSNotAFeedErrorDescription"        = "Strömmen kunde inte läsas in eftersom innehållet inte är i ett känt strömformat.";
"PSNotAFeedErrorFailureReason"      = "Innehållet är inte i ett känt strömformat.";
"PSNotAFeedErrorRecoverySuggestion" = "Kontrollera att den angivna platsen innehåller en ström i antingen Atom- eller RSS-format.";

"NSURLErrorUserAuthenticationRequired Description" = "Användarnamn och lösenord krävs";

/* Localized date/time formats. See DateClass.cpp */

"TodayFmt"      = "'Idag' HH:mm";
"YesterdayFmt"  = "'Igår' HH:mm";
"ThisWeekFmt"   = "EEEE HH:mm";
"ThisYearFmt"   = "d MMM HH:mm";
"PastYearFmt"   = "d MMM '-yy HH:mm";

/* Localizable file size formatters.  See StringClass::representationForBytes */

"0 bytes"            = "0 byte";           /* String used for showing a zero byte size */
"1 byte"             = "1 byte";            /* String used for showing a one byte size */
"%.0f bytes"         = "%.0f byte";        /* Format used to display a size between 2 and 100 bytes */
"%.1f KB (0.1)"      = "%.1f K";           /* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (1.0)"      = "%.1f K";           /* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (10.0)"     = "%.1f K";           /* Format used to display sizes between 10 and 99.9 KB */
"%.0f KB"            = "%.0f K";           /* Format used to display sizes between 100 and 999 KB */
"%.1f MB (1.0)"      = "%.1f MB";           /* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (10.0)"     = "%.1f MB";           /* Format used to display sizes between 10 and 99.9 MB */
"%.0f MB"            = "%.0f MB";           /* Format used to display sizes between 100 and 999 MB */
"%.1f GB (1.0)"      = "%.2f GB";           /* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (10.0)"     = "%.2f GB";           /* Format used to display sizes between 10 and 99.9 GB */
"%.0f GB"            = "%.0f GB";           /* Format used to display sizes 100 GB or greater */

/* Localizable file names. Currently only used in EnclosureCore.cpp */

"kUntitledFileName" = "Namnlös";   /* If we download and enclosure for which we have no other name to go by */
